using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace CSTest._10_Collections
{
    /*
    Коллекция представляет собой набор объектов схожих типов, сгруппированных вместе.  
    Емкость коллекции — это число элементов, которое она может содержать.  
    Количество элементов коллекции — это число элементов, которое она реально содержит. 
    Нижняя граница коллекции — это индекс ее первого элемента. 
    
    Коллекции стоит применять, если:
    - Отдельные элементы используются для одинаковых целей и одинаково важны.
    - На момент компиляции число элементов неизвестно или не зафиксировано.
    - Необходима поддержка операции перебора всех элементов.
    - Необходима поддержка упорядочивания элементов.
    - Необходимо использовать элементы из библиотеки, от которой 
        потребитель ожидает наличия типа коллекции.

    
    */
    class _01_Base
    {
    }
}
