using Microsoft.VisualStudio.TestTools.UnitTesting;

namespace CSTest._01_Elements_CS._01_Types
{
    [TestClass]
    public class _02_Numeric
    {
        [TestMethod]
        public void TestNumeric1()
        {
            #region ЦЕЛЫЕ ТИПЫ

            // 8-bits == 1 byte. ----------------------------------------------------------------------------

            // Целое без знака. Диапазон - от 0 до 255.
            byte a = 0;
            System.Byte b = 255;

            // Целое со знаком. Диапазон - от -128 до +127.
            sbyte c = -128;
            System.SByte d = +127;


            // 16-bits == 2 bytes. -------------------------------------------------------------------------

            // Целое без знака. Диапазон - от 0 до 65535.
            ushort e = 0;
            System.UInt16 f = 65535;

            // Целое со знаком. Диапазон - от -32768 до +32767.
            short g = -32768;
            System.Int16 h = +32767;


            // 32-bits = 4 bytes. ---------------------------------------------------------------------------

            // Целое без знака. Диапазон - от 0 до 4294967295.
            uint i = 0u;
            System.UInt32 j = 4294967295U;

            // Целое со знаком. Диапазон - от -2147483648 до +2147483647.
            int k = -2147483648;
            System.Int32 l = +2147483647;


            // 64-bits = 8 bytes. ---------------------------------------------------------------------------

            // Целое без знака. Диапазон - от 0 до 18446744073709551615.
            ulong m = 0ul;
            System.UInt64 n = 18446744073709551615UL;

            // Целое со знаком. Диапазон - от -9223372036854775808 до +9223372036854775807.
            long o = -9223372036854775808L;
            System.Int64 p = +9223372036854775807L;

            #endregion
        }
    }
}
